{
	"Format": "1.14.0",
	"Changes": [
		/* I'm adding dialogue here--hopefully more to come! -Glow */
		{
			"Action": "EditData",
			"Target": "Characters/Dialogue/Krobus",
			"Entries": {
				"Fri": "...",
				"Sewer_Mon": "Humans are fascinating to observe, but I must be careful to stay hidden.",
				"Sewer_Tue": "I am too sensitive to sunlight to go out on most days.#$b#The conditions in here are perfect.#$e#Care to buy anything?",
				"Sewer_Wed": "I find things here and I sell them. Care to buy anything?",
				"Sewer_Thu": "Please don't tell anyone about me.#$b#Humans tend to destroy things they can't understand.",
				"Sewer_Sat": "On Fridays I stay silent as a sign of devotion to Yoba.",
				"Sewer_Sun": "...Sorry, I'm still a little wary of humans. My shop is still open to you, however.",
				"Sewer_Mon2": "Back again? I suppose it does fit into my theory of human behavior.",
				"Sewer_Tue2": "The smell? ...Ah, I see. My sense of smell is rather weak compared to a human's, so the particular miasma of the sewer does not trouble me.#$e#Many culinary delicacies of the shadow are highly aromatic. I am particularly fond of void egg concoctions.#$h",
				"Sewer_Summer11": "I would be most interested in your description of the human 'luau.' Unfortunately, the sun is too bright for me to observe it directly.",
			}
		},
		{
			"Action": "EditData",
			"Target": "Data/Events/Sewer",
			"Entries": {
				"31072020": "continue/15 16/farmer 15 15 2 Krobus 29 21 1/playMusic Icicles/emote Krobus 8/speed Krobus 4/move Krobus -10 0 2/jump farmer 8/jump Krobus 8/faceDirection Krobus 0/speak Krobus \"Oh! A human...\"/speak Krobus \"P-Please, don't be alarmed. I am different than the others.$s\"/speak Krobus \"Yes, I can speak your language. I've spent a lot of time observing humans...from the shadows.$h#$b#...#$b#Perhaps...\"/speak Krobus \"I know humans like to shop. Care to see my wares?$h\"/emote farmer 32/pause 500/globalFade/viewport -1000 -1000/speak Krobus \"I gather items I find here in the sewers to sell. I also have trinkets and treasures made by my people. I hope you find something that pleases you.$h\"/end dialogue Krobus \"I am open for business.\""
				/*breakdown of the code, for our learning:
				First is the ID, I chose the day, woohoo!
				continue is the initial "music". (15, 16) are the coordinates the camera is focused on.
				Next are the coordinates of the farmer and Krobus, (X, Y, direction they're facing).
				I then set the music to play, Icicles, because it wouldn't work in the first slot, where continue is. Jonqora and I don't know why. 
				Then we have Krobus with the "?" emote before turning around to discover the farmer! They both jump; 8 is the default value for jump. Not sure what happens if we make it greater or smaller, but that can be tested!
				Then the dialog happens, which include the portraits.
				Then there's the farmer emote of the cute smiley face.
				Screen fades to black.
				Krobus mentions his last bit of dialog, and the event ends.
				Then there's the placeholder for the dialog that Krobus will say next time you talk to him.

				Additional enhancements I thought of:
				1) Currently this event plays the next time you go into the sewers, so we may want to look into adding a When condition so this only plays the first time you go into the sewer. I'd have to look into it.
				2) I think it'd be nice if the farmer and Krobus walk back together towards where his shop is. His movement will be simple since he's only moving along the X axis, but the farmer's movement would be tougher, unless we're able to just have them move along the Y axis and the scene fades to black before they have to turn the corner!
				*/
			}
		}
	]
}